cavity_1000/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.5;

vertices
(
    (0 0 0)   // 0
    (1 0 0)   // 1
    (1 1 0)   // 2
    (0 1 0)   // 3
    (0 0 0.1) // 4
    (1 0 0.1) // 5
    (1 1 0.1) // 6
    (0 1 0.1) // 7

    (2 0 0.1) // 8
    (2 1 0.1) // 9
    (2 0 0)  // 10
    (2 1 0)  // 11
    (0 -1 0) // 12
    (1 -1 0) // 13
    (0 -1 0.1) // 14
    (1 -1 0.1) // 15
    (2 -1 0.1) // 16
    (2 -1 0) // 17 

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 100 1) simpleGrading (10 0.1 1)
    hex (1 10 11 2 5 8 9 6) (100 100 1) simpleGrading (0.1 0.1 1)
    hex (12 13 1 0 14 15 5 4) (100 100 1) simpleGrading (10 10 1)
    hex (13 17 10 1 15 16 8 5) (100 100 1) simpleGrading (0.1 10 1)

);

edges
(
);

boundary
(
    topWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
            (6 9 11 2)
        );
    }

    fixedWalls
    {
        type wall;
        faces
        (    
            (0 4 7 3)
            (10 11 9 8)
            (12 14 4 0)
            (13 15 14 12)
            (17 16 15 13)
            (17 10 8 16)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
            (1 2 11 10)
            (8 9 6 5)
            (12 0 1 13)
            (13 17 10 1)
            (14 15 5 4)
            (15 16 8 5)
           
        );
    }
);


// ************************************************************************* //
