cavity_1000/system/probes
#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

fields (U p);
probeLocations
(
    (0.5 0 0.025)
);


// ************************************************************************* //
